app/controllers/api/v1/horarios_controller.rb

SELECT "horarios".* FROM "horarios"
---
            def index
                    horarios = Horario.all

SELECT "horarios".* FROM "horarios" WHERE "horarios"."diasemana" IS NULL AND "horarios"."data" IS NULL
---
            def show
                horarios = Horario.where(diasemana:params[:diasemana],data:params[:data])