app/controllers/api/v1/horarios_controller.rb

SELECT "horarios".* FROM "horarios"
---
            def index
                    horarios = Horario.all