app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? AND "users"."tipodeusuario" IS NULL  [["id", 1]]
---
            def show
                users = User.where(id:params[:id],tipodeusuario:params[:tipodeusuario])

INSERT INTO "users" ("login", "password", "email", "cpf", "endereco", "nome", "sobrenome", "tipodeusuario", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
            def create
                if check_cpf(params[:cpf])
                    user = User.new(user_param)
                    if user.save